<a href="https://colab.research.google.com/github/het-khatusuriya/ML/blob/main/d22ce166_read__and_write_csv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## <font color="purple"><h4 align="center">Read/Write CSV and Excel Files in Pandas</font>

### <font color="blue">Read CSV</color>

In [ ]:
import pandas as pd
#here we read the dataframe
df = pd.read_csv("stock_data.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [ ]:
df = pd.read_csv("stock_data.csv", skiprows=1)
#here we read the dataframe and skiprows are 1
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [ ]:
df = pd.read_csv("stock_data.csv", header=1) # skiprows and header are kind of same
#here we read the dataframe and header are 1

df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [ ]:
df = pd.read_csv("stock_data.csv", header=None, names = ["ticker","eps","revenue","people"])
#here we read the dataframe and then we set the name of column as "ticker","eps","revenue","people"
dffu

                ticker      eps revenue         people
tickers            eps  revenue   price         people
GOOGL            27.82       87     845     larry page
WMT               4.61      484      65           n.a.
MSFT                -1       85      64     bill gates
RIL      not available       50    1023  mukesh ambani
TATA               5.6       -1    n.a.     ratan tata

In [ ]:
#here we read dataframe of first two rows
df = pd.read_csv("stock_data.csv",  nrows=2)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [ ]:
# Read the stock data from a CSV file into a DataFrame, replacing 'n.a.' and 'not available' with NaN values
df = pd.read_csv("stock_data.csv", na_values=["n.a.", "not available"])

# Display the DataFrame
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [ ]:
# Read the stock data from a CSV file into a DataFrame, replacing specific values with NaN for missing or unavailable data
df = pd.read_csv("stock_data.csv", na_values={
        'eps': ['not available'],  # Replace 'not available' with NaN in the 'eps' column
        'revenue': [-1],  # Replace -1 with NaN in the 'revenue' column
        'people': ['not available','n.a.']  # Replace 'not available' and 'n.a.' with NaN in the 'people' column
    })

# Display the DataFrame
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

<font color="blue">Write to CSV</color>

In [ ]:
df.to_csv("new1.csv", index=False)
# Write the DataFrame 'df' to a CSV file named 'new1.csv' without including index

In [ ]:
df.columns
#show the name of column

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [ ]:
# Write the DataFrame 'df' to a CSV file named 'new1.csv' without including index or header
df.to_csv("new1.csv", index=False, header=False)

In [ ]:
df.to_csv("new1.csv", columns=["tickers","price"], index=False)
# Write the DataFrame 'df' to a CSV file named 'new1.csv' without including index or header
#and make the dataframe with two column name tickers and price

### <font color="blue">Read Excel</color>

In [ ]:
df = pd.read_excel("stock_data.xlsx","Sheet1")
#read the excel sheet
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [ ]:
# Define custom functions to convert specific cell values in the Excel file

def convert_people_cell(cell):
    if cell == "n.a.":
        return 'Sam'
    return cell

def convert_price_cell(cell):
    if cell == "n.a.":
        return 100
    return cell

# Read data from the "Sheet1" of an Excel file into a DataFrame,
# applying custom converters to the 'people' and 'price' columns
df = pd.read_excel("stock_data.xlsx", "Sheet1", converters={
        'people': convert_people_cell,
        'price': convert_price_cell
    })

# Display the resulting DataFrame
df

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65            Sam
2    MSFT             -1       85     64     bill gates
3    RIL   not available       50   1023  mukesh ambani
4    TATA            5.6       -1    100     ratan tata

### <font color="blue">Write to Excel</color>

In [ ]:
# Write the DataFrame 'df' to an Excel file named 'new.xlsx' with a sheet named 'stocks',
# starting at row 2 and column 1, without including the index column

df.to_excel("new.xlsx", sheet_name="stocks", index=False, startrow=2, startcol=1)

**Write two dataframes to two separate sheets in excel**

In [ ]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})
#here we make the datafrome
df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [ ]:
# Write two DataFrames, 'df_stocks' and 'df_weather', to an Excel file named 'stocks_weather.xlsx'
# using a context manager with the ExcelWriter object

with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")   # Write 'df_stocks' to the 'stocks' sheet
    df_weather.to_excel(writer, sheet_name="weather") # Write 'df_weather' to the 'weather' sheet